0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.2 0 0);

boundaryField
{
    upstream
    {
        type            fixedValue;
        value           uniform (0.2 0 0);
    }

    downstream
    {
        type            inletOutlet;
        inletValue      uniform (0.2 0 0)
        value           $internalField;
        
   }
    upANDdown
    {
        type            inletOutlet;
        inletValue      uniform (0.2 0 0)
        value           $internalField;
        
   }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }


    cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
