0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    upstream
    {
        type            fixedValue;
        value           uniform 101325;
    }

    downstream
    {
        type            fixedValue;
        value           uniform 101325;
        
   }
    upANDdown
    {
        type            fixedValue;
        value           uniform 101325;
   }

    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }

    cylinder
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
